In [1]:
import pandas as pd

In [3]:
x=3
y=7
xy = 'Hello World'

In [4]:
print x+y, xy

10 Hello World

In [5]:
x=y=2

In [6]:
print x,y

2 2

In [7]:
1+3

4

In [8]:
6-4

2

In [9]:
2*4

8

In [10]:
1/3

0

In [11]:
1/3.0

0.3333333333333333

In [12]:
16%11

5

In [13]:
3.8//3.0

1.0

In [14]:
z=3

In [15]:
z==2

False

In [16]:
z > 1

True

In [21]:
print int('010',4)
print int('0xaa',16)
print int('1010',2)

4
170
10

In [22]:
print int(8.8)
print int('8')

8
8

In [23]:
print float(77534)
print float(2)

77534.0
2.0

In [24]:
chr(78)

'N'

In [25]:
ord('d')

100

In [26]:
print round(8.4532) 
print round(6.88552, 2)

8.0
6.89

In [27]:
a =complex('6+3j')
print abs(a)

6.7082039325

In [28]:
print isinstance(0, int)
print isinstance(0.1,int)
print isinstance(0.1,(int,float))

True
False
True

In [54]:
print cmp(2,3)
print cmp(3,2)
print cmp(3,3)

-1
1
0

In [35]:
print pow(4,4)
print pow(4,4,5)

256
1

In [36]:
print range(4)
print range(3,8)
print range(3,26,7)

[0, 1, 2, 3]
[3, 4, 5, 6, 7]
[3, 10, 17, 24]

In [48]:
print "Goodbye Earth"

Goodbye Earth

In [38]:
print "Hey"

Hey

In [40]:
print"""My name is Nkechi
I love Python"""

My name is Nkechi
I love Python

In [50]:
string1 = 'Earth'
print 'Goodbye', string1

string2 = '!'
print 'Goodbye', string1, string2

Goodbye Earth
Goodbye Earth !

In [61]:
print 'Goodbye' + string1 + string2

GoodbyeEarth!

In [52]:
print "Goodbye %s" % string1

Goodbye Earth

In [55]:
print "Actual Number = %d" %16
print "Float of the number = %f" %16
print "Octal equivalent of the number = %o" %16
print "Hexadecimal equivalent of the number = %x" %16
print "Exponential equivalent of the number = %e" %16

Actual Number = 16
Float of the number = 16.000000
Octal equivalent of the number = 20
Hexadecimal equivalent of the number = 10
Exponential equivalent of the number = 1.600000e+01

In [63]:
print "Goodbye %s %s" %(string1,string2)

Goodbye Earth !

In [67]:
b = []

In [68]:
print type(b)

<type 'list'>

In [84]:
y = ['peaches', 'kiwis']

In [71]:
y = [0]

In [85]:
y[-1]

'kiwis'

In [78]:
x = ['cucumber','pepper']

In [86]:
z = [y,x]
print z

[['peaches', 'kiwis'], ['carrot', 'potato']]

In [81]:
z1 = z[0]
print z1

('peaches', 'kiwis')

In [82]:
z1[0]

'peaches'

In [83]:
z[0][0]

'peaches'

In [87]:
numbers = [0,1,2,3,4,5,6,7,8,9]

In [88]:
print numbers[0:3]
print numbers[5:]

[0, 1, 2]
[5, 6, 7, 8, 9]

In [89]:
len(numbers)

10

In [90]:
max(numbers)

9

In [91]:
list('Jennifer')

['J', 'e', 'n', 'n', 'i', 'f', 'e', 'r']

In [92]:
abc = divmod(10,3)
print abc
print type(abc)

(3, 1)
<type 'tuple'>

In [93]:
tup5 = tuple([3,4,6])
print tup5
tup6 = tuple('Hi')
print tup6

(3, 4, 6)
('H', 'i')

In [97]:
a = 11
if a >8:
    print "Thanks"

Thanks

In [96]:
a = 5
if a > 10:
    print "yes"
else:
    print "no"

no

In [98]:
a = 33
b = 2
if a > b:
    print "a>b"
elif a < b:
    print "a<b"
    if x==33:
        print "x=33"
    else:
        print "invalid"
else:
    print "a=b"

a>b

In [99]:
for i in range(12):
    print i

0
1
2
3
4
5
6
7
8
9
10
11

In [100]:
list_of_lists = [[3, 5, 7], [4, 15, 12], [1, 8, 9]]
for list1 in list_of_lists:
        print list1

[3, 5, 7]
[4, 15, 12]
[1, 8, 9]

In [101]:
list_of_lists = [[3, 5, 7], [4, 15, 12], [1, 8, 9]]
for list1 in list_of_lists:
    for x in list1:
        print x

3
5
7
4
15
12
1
8
9

In [102]:
for i in range(12):
    if i>5:
        print "End."
        continue
    elif i<8:
        print i

0
1
2
3
4
5
End.
End.
End.
End.
End.
End.

In [103]:
new = []
for i in range(1,5):
    a = 16*i
    new.append(a)
print new

[16, 32, 48, 64]

In [104]:
import pandas as pd
import datetime

In [114]:
info = datetime.datetime(2012,12,1)
fin = datetime.datetime(2012,12,8)
inter = datetime.timedelta(days=1)
dates = []

In [115]:
while info < fin:
    dates.append(info.strftime('%m-%d'))
    info += inter

In [133]:
dates

['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07']

In [131]:
e = {'Date': dates, 'London' : [15,19,15,11,9,8,13], 'New York': [-2,0,2,5,7,-5,-3], 'Mumbai':[20,18,23,19,25,27,23]}

In [132]:
e

{'Date': ['12-01', '12-02', '12-03', '12-04', '12-05', '12-06', '12-07'],
 'London': [15, 19, 15, 11, 9, 8, 13],
 'Mumbai': [20, 18, 23, 19, 25, 27, 23],
 'New York': [-2, 0, 2, 5, 7, -5, -3]}

In [134]:
dframe = pd.DataFrame(e)

In [135]:
ndframe = dframe['London']

In [136]:
ndframe

0    15
1    19
2    15
3    11
4     9
5     8
6    13
Name: London, dtype: int64

In [140]:
dframe

    Date  London  Mumbai  New York
0  12-01      15      20        -2
1  12-02      19      18         0
2  12-03      15      23         2
3  12-04      11      19         5
4  12-05       9      25         7
5  12-06       8      27        -5
6  12-07      13      23        -3

In [141]:
from pandas import Series, DataFrame

In [142]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

In [146]:
item = pd.Series([3, 5, -7, 13])
item

0     3
1     5
2    -7
3    13
dtype: int64

In [147]:
item.values
item.index

RangeIndex(start=0, stop=4, step=1)

In [148]:
item2 = pd.Series([3, 5, -7, 13], index=['d', 'b', 'a', 'c'])
item2
item2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [149]:
item2['a']
item2['d'] = 6
item2[['c', 'a', 'd']]

c    13
a    -7
d     6
dtype: int64

In [152]:
data = {'state': ['New York', 'New York', 'New York', 'Kentucky', 'Kentucky', 'Kentucky'],
        'year': [2010, 2011, 2012, 2011, 2012, 2013],
        'pop': [1.4, 2.7, 2.5, 1.4, 5.9, 4.2]}
dframe = pd.DataFrame(data)

In [153]:
dframe

   pop     state  year
0  1.4  New York  2010
1  2.7  New York  2011
2  2.5  New York  2012
3  1.4  Kentucky  2011
4  5.9  Kentucky  2012
5  4.2  Kentucky  2013

In [154]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year     state  pop
0  2010  New York  1.4
1  2011  New York  2.7
2  2012  New York  2.5
3  2011  Kentucky  1.4
4  2012  Kentucky  5.9
5  2013  Kentucky  4.2

In [155]:
dframe2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
dframe2
dframe2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [157]:
dframe2['state']
dframe2.year

one      2010
two      2011
three    2012
four     2011
five     2012
six      2013
Name: year, dtype: int64

In [158]:
dframe2.loc['three']

year         2012
state    New York
pop           2.5
debt          NaN
Name: three, dtype: object

In [160]:
dframe2['debt'] = 13.4
dframe2
dframe2['debt'] = np.arange(6.)
dframe2

       year     state  pop  debt
one    2010  New York  1.4   0.0
two    2011  New York  2.7   1.0
three  2012  New York  2.5   2.0
four   2011  Kentucky  1.4   3.0
five   2012  Kentucky  5.9   4.0
six    2013  Kentucky  4.2   5.0

In [161]:
dframe2['eastern'] = dframe2.state == 'New York'
dframe2

       year     state  pop  debt  eastern
one    2010  New York  1.4   0.0     True
two    2011  New York  2.7   1.0     True
three  2012  New York  2.5   2.0     True
four   2011  Kentucky  1.4   3.0    False
five   2012  Kentucky  5.9   4.0    False
six    2013  Kentucky  4.2   5.0    False

In [162]:
dframe2.columns

Index([u'year', u'state', u'pop', u'debt', u'eastern'], dtype='object')

In [163]:
dframe2.T

              one       two     three      four      five       six
year         2010      2011      2012      2011      2012      2013
state    New York  New York  New York  Kentucky  Kentucky  Kentucky
pop           1.4       2.7       2.5       1.4       5.9       4.2
debt            0         1         2         3         4         5
eastern      True      True      True     False     False     False

In [168]:
pop = {'Kentucky': {2011: 2.4, 2012: 2.9},
       'New York': {2010: 1.5, 2011: 1.7, 2012: 3.6}}

In [169]:
dframe3 = pd.DataFrame(pop)
dframe3

      Kentucky  New York
2010       NaN       1.5
2011       2.4       1.7
2012       2.9       3.6

In [171]:
pd.DataFrame(pop, index=[2011, 2012])

      Kentucky  New York
2011       2.4       1.7
2012       2.9       3.6

In [172]:
dframe3.index.name = 'year'; dframe3.columns.name = 'state'
dframe3

state  Kentucky  New York
year
2010        NaN       1.5
2011        2.4       1.7
2012        2.9       3.6

In [173]:
dframe3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [174]:
dframe3['Kentucky']

year
2010    NaN
2011    2.4
2012    2.9
Name: Kentucky, dtype: float64

In [179]:
dframe = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['w', 'y', 'z'],
                     columns=['Ohio', 'Texas', 'California'])
dframe

   Ohio  Texas  California
w     0      1           2
y     3      4           5
z     6      7           8

In [180]:
dframe['Texas']

w    1
y    4
z    7
Name: Texas, dtype: int64

In [181]:
dframe[['Ohio', 'Texas']]

   Ohio  Texas
w     0      1
y     3      4
z     6      7

In [184]:
dframe['w':'y']

   Ohio  Texas  California
w     0      1           2
y     3      4           5

In [185]:
dframe[:2]

   Ohio  Texas  California
w     0      1           2
y     3      4           5

In [186]:
dframe[:1]

   Ohio  Texas  California
w     0      1           2

In [189]:
dframe[:1]["Ohio"]

w    0
Name: Ohio, dtype: int64

In [190]:
dframe[:1]["California"]

w    2
Name: California, dtype: int64

In [192]:
dframe[dframe.Texas > 1]

   Ohio  Texas  California
y     3      4           5
z     6      7           8

In [194]:
dframe < 3

    Ohio  Texas  California
w   True   True        True
y  False  False       False
z  False  False       False